src/xmlsamples/request_download_1.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:cwmp="urn:dslforum-org:cwmp-1-0">
        <SOAP-ENV:Header>
                <cwmp:ID SOAP-ENV:mustUnderstand="1">50</cwmp:ID>
        </SOAP-ENV:Header>
        <SOAP-ENV:Body>
                <cwmp:RequestDownload>
                  <FileType>2 Web Content</FileType>
                  <FileTypeArg SOAP-ENC:arrayType="cwmp:ArgStruct[1]">
                     <ArgStruct>
                       <Name>Version</Name>
                       <Value>v2.0</Value>
                     </ArgStruct>
                  </FileTypeArg>
                </cwmp:RequestDownload>
        </SOAP-ENV:Body>
</SOAP-ENV:Envelope>